IDEA Open Model
NumberGroups.Create Method (IEnumerable<Double>)
Compatible with IDEA StatiCa 20.1
 Creates new instance with one group with specified sequence of numbers.
 Namespace: IdeaRS.OpenModel.Parameters
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public static NumberGroups Create(
	IEnumerable<double> positions
)
Public Shared Function Create (
	positions As IEnumerable(Of Double)
) As NumberGroups
Parameters
positions
Type: System.Collections.Generic.IEnumerable<Double>
The sequence of numbers to add to group.
Return Value
Type: NumberGroups
A new instance of group.
See Also
Reference
NumberGroups Class
Create Overload
IdeaRS.OpenModel.Parameters Namespace